<?php

    $menu = [
        'Первый пункт' => ['первый подпункт первого пункта'=>['элемент 1','элемент '], 'второй подпункт первого пункта'],
        'Второй пункт' => ['первый подпункт второго пункта', 'второй подпункт второго пункта'],
        'Третий пункт' => ['первый подпункт третьего пункта', 'второй подпункт третьего пункта'],
    ];
        echo '<ul>';
        foreach ($menu as $key => $val) { ?>
            <li><?php echo $key; ?>  

                <ul>
                    <?php

                    foreach ($val as $item) { ?>      
                        <li><?php echo $item; ?></li>
                    <?php }

                    ?>
                </ul>

            </li>
        <?php }
        echo '</ul>';

        ?>